<?php
class CategoryConfig {
    const VEGETABLE = 1;
    const FRUIT = 2;

    public static $category = array(
        self::VEGETABLE => array( // 1 - 99为蔬菜分类
            1 => '叶菜类',
            2 => '果菜类',
            3 => '瓜类/西红柿类',
            4 => '豆角/芸豆类',
            5 => '根茎类',
            6 => '菜花/西兰花/包心菜/大白菜',
            7 => '葱姜蒜',
            8 => '鲜食用菌',
            9 => '有机蔬菜',
            10 => '特色蔬菜',
            11 => '茄子辣椒',
        ),
        self::FRUIT => array( // 100 - 199为水果分类
            100 => '苹果类',
            101 => '柑橘类',
            102 => '瓜类',
            103 => '桃/李/杏类',
            104 => '热带水果',
            105 => '梨类',
            106 => '浆果类',
            107 => '有机水果',
            108 => '进口水果',
            109 => '国产水果',
        )
    );
}
